krapyv/stm32-i2c-driver/i2c.c
            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 = sr1_snap;

            uint32_t cr1_modified = cr1_snap;

            // set the STOP bit to 1
            cr1_modified |= (1 << 9);
            // set the ACK bit to 1
            cr1_modified |= (1 << 10);
            // clear the POS bit
            cr1_modified &= ~(1 << 11);

            // direct write of the modified CR1 to I2C->CR1
            I2C->CR1 = cr1_modified;

            return 1;
        }

        // secondly, check the bit
        if (sr1_snap & bit_mask)
        {
            // if the bit is set, exit the loop
            return 0;
        }
    }
}

uint8_t I2C_PollHardwareBusy(I2C_RegDef_t *I2C)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;
        uint32_t sr2_snap = I2C->SR2;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 10) | (1 << 9) | (1 << 8)))
        {
            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 &= ~((1 << 10) | (1 << 9) | (1 << 8));

            // generate STOP condition to gracefuly and safely release the lines
            I2C->CR1 |= (1 << 9);

            return 1;
        }

        if (!(sr2_snap & (1 << 1)))
        {
            // if the BUSY bit is 0, exit the loop
            return 0;
        }
    }
}

I2C_Status_t I2C_Master_Transmit(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c == NULL || hi2c->Instance == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c->Instance;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(I2C))
    {
        return I2C_ERROR;
    }

    // start the transaction by issuing START (set to 1)
    I2C->CR1 |= (1 << 8);
    // START is cleared by hardware when start is sent

    // polling the SB (Start bit)
    // when exit, the bit is set, start condition generated
    if (I2C_PollHardwareFlags(I2C, I2C_SB_MASK))
    {
        return I2C_ERROR;
    }

    // SB is cleared by reading SR1 (done in the poll above) + writing DR
    // SR1 read is already consumed by the polling loop - writing DR now completes the clear

    // write the slave address to the DR register (it will start sending the bits to the slave and clear the SB bit)
    // 7 bit slave address + W (Write) bit 0
    I2C->DR = (slave_addr << 1) & ~0x01; // 0x01 = 2^0 = 1 = (1 << 0)

    // polling the ADDR (Address sent) bit
    // the bit is set after the ACK of the byte
    if (I2C_PollHardwareFlags(I2C, I2C_ADDR_MASK))
    {
        return I2C_ERROR;
    }

    // read the SR1 and SR2 to clear the ADDR bit in the SR1
    // SR1 read is already consumed by the polling loop above - reading SR2 now completes the clear
    uint32_t dummy = I2C->SR2;
    (void)dummy; // preventing the compiler warnings of an unused variable

    // ensure we are the Master (MSL, bit 0 = 1) and Transmitter (TRA, bit 2 = 1)
    // 0b0101 = 2^2 + 2^0 = 4 + 1 = 5 = 0x05
    if ((dummy & ((1 << 2) | (1 << 0))) != 0x05)
    {
        // if we enter this if body, the hardware is desynchronized
        // force STOP
        I2C->CR1 |= (1 << 9);
        return I2C_ERROR;
    }

    for (uint8_t i = 0; i < length; i++)
    {
        // polling the TxE Transmitters Data register empty
        // goes high after every byte leaves the DR
        if (I2C_PollHardwareFlags(I2C, I2C_TXE_MASK))
        {
            return I2C_ERROR;
        }

        I2C->DR = data[i];
    }

    // before sending the STOP condition
    // we need to make sure the byte has left the shift register, so we are not going to corrupt the last byte mid-sending
    // polling the Byte transfer finished
    if (I2C_PollHardwareFlags(I2C, I2C_BTF_MASK))
    {
        return I2C_ERROR;
    }

    // issuing the Stop generation
    I2C->CR1 |= (1 << 9);

    return I2C_OK;
}

I2C_Status_t I2C_Master_Receive(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    // declare a local I2C var to simplify the naming
    I2C_RegDef_t *I2C = hi2c->Instance;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(I2C))
    {
        return I2C_ERROR;
    }

    // Master issues the Start
    I2C->CR1 |= (1 << 8);
    // hardware clears it after the start is sent

    // poll the SB bit 0 in SR1
    if (I2C_PollHardwareFlags(I2C, I2C_SB_MASK))
    {
        return I2C_ERROR;
    }

    // clear the SB bit 0 in SR1 by readimg the SR1 and then writing the DR with the slave's address
    // SR1 read is consumed in the loop above, so the DR write completes a clear

    // write a peripheral address to the DR
    // since we want to read data bytes from the peripheral, we are setting the bit 0 (R) as 0x01 = 1
    I2C->DR = (slave_addr << 1) | (0x01 << 0);

    // poll the ADDR
    // hardware sets it to 1 after the ACK of the byte, so after the peripheral has acknowledged its address
    if (I2C_PollHardwareFlags(I2C, I2C_ADDR_MASK))
    {
        return I2C_ERROR;
    }

    /* ----- ONE-BYTE SCENARIO ----- */
    if (length == 1)
    {
        // we have already polled ADDR

        // clear the ACK (Bit 10 CR1)
        I2C->CR1 &= ~(1 << 10);
    }
    /* ----- ONE-BYTE SCENARIO ----- */

    // read the SR1 and SR2 to clear the ADDR bit in the SR1
    // SR1 read is consumed in the ADDR polling loop, so SR2 read completes a clear
    uint32_t dummy = I2C->SR2;
    (void)dummy; // preventing the compiler warnings of an unused variable

    // ensure we are the Master (MSL, bit 0 = 1) and Receiver (TRA, bit 2 = 0)
    // 0b0001 = 2^0 = 1 = 0x01
    if ((I2C->SR2 & ((1 << 2) | (1 << 0))) != 0x01)
    {
        // if we enter this if body, the hardware is desynchronized
        // force STOP
        I2C->CR1 |= (1 << 9);
        return I2C_ERROR;
    }

    /* ----- ONE-BYTE SCENARIO ----- */
    if (length == 1)
    {
        // set STOP condition
        I2C->CR1 |= (1 << 9);

        // wait for a byte from the peripheral (poll RxNE Bit 6)
        if (I2C_PollHardwareFlags(I2C, I2C_RXNE_MASK))
        {
            return I2C_ERROR;
        }

